Repository: NMarjou/localization-app
Catalog: TMs/en-US_th-TH.tmx
Source language: en_us
Languages: th_th

source: Set the workflow of the compensation round by determining approval dates
th_th: กำหนดเวิร์กโฟลว์ของรอบการจ่ายผลตอบแทนโดยการกำหนดวันที่อนุมัติ

source: Duplicate configuration
th_th: คัดลอกการกำหนดค่า

source: Step enabled
th_th: เปิดใช้งานขั้นตอนแล้ว

source: Step end date
th_th: วันที่สิ้นสุดขั้นตอน

source: The step end date must be before the end date of all the next steps.
th_th: วันที่สิ้นสุดขั้นตอนนี้ต้องอยู่ก่อนวันที่สิ้นสุดของทุกขั้นตอนถัดไป

source: The step end date must be after the end date of all the previous steps.
th_th: วันที่สิ้นสุดของขั้นตอนนี้จะต้องอยู่หลังวันที่สิ้นสุดของทุกขั้นตอนก่อนหน้า

source: The step date is outside the round period ({{startDate}} – {{endDate}}).
th_th: วันที่ของขั้นตอนอยู่นอกช่วงรอบ ({{startDate}} – {{endDate}})

source: The step end date can not be empty.
th_th: วันสิ้นสุดของขั้นตอนต้องไม่เว้นว่าง

source: Field permissions
th_th: สิทธิ์ของฟิลด์

source: Editing the workflow (i.e. adding, deleting, or reordering steps) will reset all workers to the first step.
th_th: การแก้ไขเวิร์กโฟลว์ (เช่น การเพิ่ม ลบ หรือสลับลำดับขั้นตอน) จะรีเซ็ตให้ผู้ปฏิบัติงานทุกคนกลับไปที่ขั้นตอนแรก

source: Step {{count}}: actions
th_th: ขั้นตอนที่ {{count}}: การดำเนินการ

source: The name can not be empty.
th_th: ต้องไม่เว้นว่างชื่อ

source: This step isn’t configured yet.
th_th: ยังไม่ได้กำหนดค่าขั้นตอนนี้

source: Step {{stepNumber}}: not configured
th_th: ขั้นตอนที่ {{stepNumber}}: ยังไม่ได้กำหนดค่า

source: Read
th_th: อ่าน

source: Remove configuration
th_th: ลบการกำหนดค่า

source: Time-based progression
th_th: การเลื่อนขั้นตามระยะเวลา

source: Automatically advance to next step when end date is reached
th_th: เลื่อนไปยังขั้นตอนถัดไปโดยอัตโนมัติเมื่อถึงวันสิ้นสุด

source: Workflow steps
th_th: ขั้นตอนของเวิร์กโฟลว์

source: Templates
th_th: เทมเพลต

source: This workflow enables parallel collaboration, with stakeholders submitting and updating proposals until the deadline.
th_th: เวิร์กโฟลว์นี้ช่วยให้สามารถทำงานร่วมกันแบบขนาน โดยผู้มีส่วนเกี่ยวข้องสามารถส่งและอัปเดตข้อเสนอได้จนถึงกำหนดเวลา

source: This workflow follows a predefined approval hierarchy, with proposals reviewed and approved in sequence.
th_th: ขั้นตอนการทำงานนี้เป็นไปตามลำดับชั้นการอนุมัติที่กำหนดไว้ล่วงหน้า โดยจะมีการตรวจสอบและอนุมัติข้อเสนอเรียงตามลำดับ

source: Action-driven
th_th: ขับเคลื่อนด้วยการลงมือปฏิบัติ

source: Steps advance per worker when actions (Proceed, Submit, Approve or Reject) are taken. Suited for flexible review processes.
th_th: ขั้นตอนจะดำเนินไปตามจำนวนผู้ปฏิบัติงานเมื่อมีการดำเนินการ (ดำเนินการต่อ, ส่ง, อนุมัติ หรือปฏิเสธ) เหมาะสำหรับกระบวนการตรวจสอบที่ยืดหยุ่น

source: All stakeholders act within the same date range, completing proposals in parallel until the end date.
th_th: ผู้มีส่วนได้ส่วนเสียทุกคนดำเนินการภายในช่วงวันที่เดียวกัน โดยดำเนินการข้อเสนอไปพร้อมกันจนถึงวันสิ้นสุด

source: Workflow type
th_th: ประเภทเวิร์กโฟลว์

source: Time-driven
th_th: ขับเคลื่อนด้วยเวลา

source: Steps follow fixed start and end dates. Access is granted only within the date range. Ideal for predictable review cycles.
th_th: ขั้นตอนจะมีวันเริ่มต้นและสิ้นสุดที่กำหนดไว้แน่นอน สามารถเข้าถึงได้เฉพาะในช่วงวันที่กำหนด เหมาะสำหรับรอบการตรวจสอบที่สามารถคาดการณ์ได้

source: View workflow
th_th: ดูเวิร์กโฟลว์

source: Type or press Ctrl+Space to open auto-suggestion. Begin with a root source such as Data model, Round inputs, or Round calculations, to find fields.
th_th: พิมพ์หรือกด Ctrl+Space เพื่อเปิดคำแนะนำอัตโนมัติ เริ่มต้นด้วยแหล่งราก เช่น Data Modeler, อินพุตรอบ หรือการคำนวณรอบ เพื่อค้นหาฟิลด์

source: Start guide
th_th: คู่มือเริ่มต้นใช้งาน

source: After selecting an item, type a dot (.) to see child properties. Keep drilling until you reach a simple value (number or text); some fields need several levels.
th_th: หลังจากเลือกรายการแล้ว ให้พิมพ์จุด (.) เพื่อดูคุณสมบัติย่อย ดำเนินการเจาะลึกต่อไปจนกว่าคุณจะถึงค่าที่เรียบง่าย (ตัวเลขหรือข้อความ) โดยบางฟิลด์อาจต้องใช้หลายระดับ

source: Drill down with dots
th_th: เจาะลงรายละเอียดด้วยจุด

source: Combine properties (round fields), operators (+, −, ×, ÷), and functions (math, text, logic) to build your formula. Auto-suggestion helps as you type.
th_th: รวมคุณสมบัติ (ฟิลด์แบบปัดเศษ) ตัวดำเนินการ (+, −, ×, ÷) และฟังก์ชัน (คณิตศาสตร์ ข้อความ ตรรกะ) เพื่อสร้างสูตรของคุณ ระบบจะช่วยเสนอคำอัตโนมัติขณะคุณพิมพ์

source: Properties, operators & functions
th_th: คุณสมบัติ ตัวดำเนินการ และฟังก์ชัน

source: Click Learn more to browse and search all properties across every nesting level. Use it to explore your round's data structure and find the exact field you need.
th_th: คลิก "เรียนรู้เพิ่มเติม" เพื่อเรียกดูและค้นหาทุกคุณสมบัติในทุกระดับการซ้อน ใช้เพื่อสำรวจโครงสร้างข้อมูลของรอบของคุณและค้นหาฟิลด์ที่คุณต้องการได้อย่างแม่นยำ

source: Browse available properties
th_th: เรียกดูคุณสมบัติที่มีให้ใช้งาน

source: Formulas with errors cannot be saved. Press F8 to jump to the next error, or double-click an error message to go directly to the issue.
th_th: สูตรที่มีข้อผิดพลาดไม่สามารถบันทึกได้ กด F8 เพื่อข้ามไปยังข้อผิดพลาดถัดไป หรือดับเบิลคลิกที่ข้อความแสดงข้อผิดพลาดเพื่อไปยังปัญหาโดยตรง

source: Fix errors to save
th_th: แก้ไขข้อผิดพลาดเพื่อบันทึก

source: {{step}} of {{total}}
th_th: {{step}} จาก {{total}}

source: Open comp round
th_th: รอบผลตอบแทนแบบเปิด

source: When switching from a hard outcome to a soft one, please note that the expression formula cannot be edited until it has been saved.
th_th: เมื่อสลับจากผลลัพธ์ที่ยากไปเป็นผลลัพธ์ที่นุ่มนวล โปรดทราบว่าไม่สามารถแก้ไขสูตรนิพจน์ได้จนกว่าจะบันทึกเสร็จ

source: Block save if this rule is not met
th_th: บล็อคการบันทึกหากไม่เป็นไปตามกฎนี้

source: Maximum outcome
th_th: ผลลัพธ์สูงสุด

source: Define the maximum outcome of the rule
th_th: กำหนดผลลัพธ์สูงสุดของกฎ

source: Minimum outcome
th_th: ผลลัพธ์ขั้นต่ำ

source: Define the minimum outcome of the rule
th_th: กำหนดผลลัพธ์ขั้นต่ำของกฎ

source: Please provide at least one active rule.
th_th: โปรดระบุกฎที่ใช้งานอยู่อย่างน้อยหนึ่งรายการ

source: The rule list is empty. Get started by creating a rule.
th_th: รายการกฎว่างเปล่า เริ่มต้นด้วยการสร้างกฎ

source: Are you sure you want to delete the compensation round?
th_th: คุณแน่ใจหรือไม่ว่าต้องการลบรอบผลตอบแทน

source: Are you sure you want to delete the pending draft of this compensation round?
th_th: คุณแน่ใจหรือไม่ว่าต้องการลบแบบร่างที่รอดำเนินการของรอบการชดเชยนี้?

source: Delete compensation round
th_th: ลบรอบผลตอบแทน

source: To confirm, type the round code: {{code}}
th_th: เพื่อยืนยัน ให้พิมพ์รหัสรอบ: {{code}}

source: The confirmation code does not match.
th_th: รหัสยืนยันไม่ตรงกัน

source: The confirmation code is required.
th_th: จำเป็นต้องมีรหัสยืนยัน

source: Delete round
th_th: ลบรอบ

source: Deleting this compensation round will remove it from active use. All proposals will be retained, but they will no longer be editable. Are you sure you want to proceed?
th_th: การลบรอบการชดเชยนี้จะทำให้ถูกนำออกจากการใช้งานปัจจุบัน ข้อเสนอทั้งหมดจะถูกเก็บไว้ แต่จะไม่สามารถแก้ไขได้อีก คุณแน่ใจหรือไม่ว่าต้องการดำเนินการต่อ?

source: You do not have permission to delete in progress compensation rounds. Only users with the Global Compensation Admin role can perform this action.
th_th: คุณไม่ได้รับสิทธิ์ในการลบรอบค่าตอบแทนที่กำลังดำเนินอยู่ เฉพาะผู้ใช้ที่มีบทบาทผู้ดูแลระบบค่าตอบแทนระดับโลกเท่านั้นที่สามารถดำเนินการนี้ได้

source: Action not allowed
th_th: ไม่อนุญาตให้ดำเนินการ

source: Delete pending draft
th_th: ลบฉบับร่างที่รอดำเนินการ

source: Open compensation round
th_th: เปิดรอบการชดเชย

source: Create payroll data drop
th_th: สร้างข้อมูลดรอปเงินเดือน

source: Data entities & sources
th_th: เอนทิตีข้อมูลและแหล่งข้อมูล

source: Define the entities and fields to be included in this model.
th_th: กำหนดเอนทิตีและฟิลด์ที่จะรวมไว้ในโมเดลนี้

source: Show only selected items and rearrange them
th_th: แสดงเฉพาะรายการที่เลือกและจัดเรียงใหม่

source: No payroll data drop yet
th_th: ยังไม่มีการอัปโหลดข้อมูลเงินเดือน

source: The payroll data drop was successfully created.
th_th: สร้างการดรอปข้อมูลเงินเดือนสำเร็จแล้ว

source: The payroll data drop was successfully saved.
th_th: บันทึกข้อมูลการจ่ายเงินเดือนสำเร็จแล้ว

source: The payroll data drop was successfully updated.
th_th: อัปเดตข้อมูลการจ่ายเงินเดือนสำเร็จแล้ว

source: Create and manage payroll data drop rules.
th_th: สร้างและจัดการกฎการดรอปข้อมูลเงินเดือน

source: The rule was successfully deleted.
th_th: ลบกฎสำเร็จแล้ว

source: The rule was successfully duplicated.
th_th: ทำการคัดลอกกฎสำเร็จแล้ว

source: Open payroll data drop
th_th: เปิดข้อมูลเงินเดือนที่ลดลง

source: Edit payroll data drop
th_th: แก้ไขข้อมูลการจ่ายเงินเดือนที่ดรอป

source: No payroll data drop configured yet
th_th: ยังไม่ได้กำหนดค่าการดึงข้อมูลเงินเดือน

source: Connection name
th_th: ชื่อการเชื่อมต่อ

source: The connection name cannot be empty.
th_th: ไม่สามารถเว้นชื่อการเชื่อมต่อว่างได้

source: Worker selection
th_th: การเลือกพนักงาน

source: Add condition blocks to configure the rule for filtering workers in the payroll data set
th_th: เพิ่มบล็อกเงื่อนไขเพื่อกำหนดกฎสำหรับการกรองพนักงานในชุดข้อมูลเงินเดือน

source: Define a name and description for this outbound connection.
th_th: กำหนดชื่อและคำอธิบายสำหรับการเชื่อมต่อขาออกนี้

source: Payroll data drop details
th_th: รายละเอียดการส่งข้อมูลเงินเดือน

source: Are you sure you want to delete this payroll data drop rule?
th_th: คุณแน่ใจหรือว่าต้องการลบกฎการดรอปข้อมูลเงินเดือนนี้หรือไม่?

source: Add translation
th_th: เพิ่มคำแปล

source: Select language
th_th: เลือกภาษา

source: Create reminder
th_th: สร้างการเตือนความจำ

source: Are you sure you want to delete this translation? <br/>This will permanently remove all configurations.
th_th: คุณแน่ใจหรือไม่ว่าต้องการลบคำแปลนี้? <br/>การดำเนินการนี้จะลบการกำหนดค่าทั้งหมดอย่างถาวร

source: Delete translation
th_th: ลบคำแปล

source: The translation was successfully deleted.
th_th: ลบคำแปลเรียบร้อยแล้ว

source: Edit reminder
th_th: แก้ไขการแจ้งเตือน

source: Reminder message
th_th: ข้อความเตือนความจำ

source: Languages: {{configured}}/{{total}}
th_th: ภาษา: {{configured}}/{{total}}

source: Comp admin contact email
th_th: อีเมลติดต่อผู้ดูแลค่าตอบแทน

source: Comp admin contact name
th_th: ชื่อผู้ติดต่อฝ่ายบริหารค่าตอบแทน

source: Comp round end date
th_th: วันที่สิ้นสุดรอบการปรับค่าตอบแทน

source: Comp round name
th_th: ชื่อรอบการจัดการค่าตอบแทน

source: Comp round start date
th_th: วันที่เริ่มรอบการปรับค่าตอบแทน

source: Comp round status
th_th: สถานะรอบการปรับค่าตอบแทน

source: Comp round type
th_th: ประเภทรอบการให้ค่าตอบแทน

source: Planner link
th_th: ลิงก์ไปยังตัววางแผน

source: Recipient full name
th_th: ชื่อเต็มของผู้รับ

source: Dynamic fields
th_th: ฟิลด์ไดนามิก

source: Field {{field}} copied to clipboard
th_th: คัดลอกฟิลด์ {{field}} ไปยังคลิปบอร์ดแล้ว

source: Email message
th_th: อีเมลข้อความ

source: The email message cannot be empty.
th_th: ข้อความอีเมลต้องไม่เว้นว่าง

source: Email subject
th_th: หัวข้ออีเมล

source: The email subject cannot be empty.
th_th: หัวเรื่องอีเมลต้องไม่เว้นว่าง

source: Email toggle
th_th: สวิตช์อีเมล

source: Manage translations
th_th: จัดการคำแปล

source: Notification bell
th_th: กระดิ่งการแจ้งเตือน

source: The notification bell message cannot be empty.
th_th: ข้อความการแจ้งเตือนทางสัญญาณกระดิ่งต้องไม่เว้นว่าง

source: Notification bell toggle
th_th: สวิตช์เปิดปิดกระดิ่งการแจ้งเตือน

source: You must enable at least one reminder message.
th_th: คุณต้องเปิดใช้งานข้อความเตือนอย่างน้อยหนึ่งข้อความ

source: View translations
th_th: ดูคำแปล

source: Reminder name
th_th: ชื่อการเตือนความจำ

source: The reminder name cannot be empty.
th_th: ไม่สามารถเว้นชื่อการแจ้งเตือนว่างไว้ได้

source: Comp managers
th_th: ผู้จัดการฝ่ายค่าตอบแทน

source: Comp managers +1
th_th: ผู้จัดการค่าตอบแทน +1

source: Recipients
th_th: ผู้รับ

source: Select the recipients of the reminder
th_th: เลือกผู้รับการเตือนความจำ

source: Select at least one recipient.
th_th: โปรดเลือกรับอย่างน้อยหนึ่งราย

source: Send reminder
th_th: ส่งการเตือนความจำ

source: You're about to send this reminder to the selected recipients. Once sent, it can't be edited or recalled.
th_th: คุณกำลังจะส่งการเตือนความจำนี้ให้กับผู้รับที่เลือกไว้ เมื่อส่งแล้วจะไม่สามารถแก้ไขหรือเรียกคืนได้

source: Sent
th_th: ส่งแล้ว

source: The reminder was successfully created.
th_th: สร้างการแจ้งเตือนเรียบร้อยแล้ว

source: The reminder was successfully sent.
th_th: ได้ส่งการแจ้งเตือนเรียบร้อยแล้ว

source: The reminder was successfully updated.
th_th: อัปเดตการแจ้งเตือนสำเร็จแล้ว

source: The translations were successfully added.
th_th: เพิ่มคำแปลเรียบร้อยแล้ว

source: Add one to get started.
th_th: เพิ่มหนึ่งรายการเพื่อเริ่มต้น

source: No translations yet.
th_th: ยังไม่มีคำแปล

source: No translations configured.
th_th: ยังไม่ได้กำหนดการแปล

source: Reminder details
th_th: รายละเอียดการแจ้งเตือน

source: Are you sure you want to delete this reminder?<br/>This will permanently remove all configurations.
th_th: คุณแน่ใจหรือไม่ว่าต้องการลบการแจ้งเตือนนี้?<br/>การดำเนินการนี้จะลบการตั้งค่าทั้งหมดอย่างถาวร

source: Delete round reminder
th_th: ลบการแจ้งเตือนรอบ

source: The round reminder was successfully deleted.
th_th: ลบการเตือนสำหรับรอบนี้เรียบร้อยแล้ว

source: Open reminder
th_th: เปิดการแจ้งเตือนเตือนความจำ

source: The round reminder was successfully duplicated.
th_th: คัดลอกการแจ้งเตือนรอบเรียบร้อยแล้ว

source: Duplication done
th_th: การทำซ้ำเสร็จสิ้นแล้ว

source: No round reminders yet.
th_th: ยังไม่มีการแจ้งเตือนรอบ

source: Send reminders to comp managers and comp managers +1.
th_th: ส่งการเตือนให้ผู้จัดการค่าตอบแทนและผู้จัดการค่าตอบแทนระดับถัดไป (+1)

source: Round reminders
th_th: การเตือนในรอบ

source: Sent date
th_th: วันที่ส่ง

source: Criterion
th_th: เกณฑ์

source: The criterion is required.
th_th: ต้องระบุเกณฑ์นี้

source: Please add at least one block.
th_th: โปรดเพิ่มอย่างน้อยหนึ่งบล็อค

source: You haven't added any blocks.
th_th: คุณยังไม่ได้เพิ่มบล็อกใด ๆ

source: Add blocks to start configuring the rule conditions.
th_th: เพิ่มบล็อคเพื่อเริ่มกำหนดค่าเงื่อนไขกฎ

source: Are you sure you want to delete this rule?
th_th: คุณแน่ใจหรือไม่ว่าต้องการลบกฎนี้

source: Add condition blocks to configure the rule
th_th: เพิ่มบล็อคเงื่อนไขเพื่อกำหนดค่ากฎ

source: Rule exceptions
th_th: ข้อยกเว้นกฎ

source: Include/exclude individuals for whom an exception to the rule is required.
th_th: รวม/ไม่รวมบุคคลที่จำเป็นต้องมีข้อยกเว้นจากกฎ

source: No rules yet
th_th: ยังไม่มีกฎ

source: The compensation round was successfully saved as pending draft.
th_th: รอบการชดเชยได้รับการบันทึกเป็นร่างที่รอดำเนินการเรียบร้อยแล้ว

source: Create and manage statement generation rules.
th_th: สร้างและจัดการกฎการสร้างสเตทเมนต์

source: Statement generation
th_th: การสร้างสเตทเมนต์

source: No comp rounds with round name or code "{{phrase}}"
th_th: ไม่มีรอบการจ่ายผลตอบแทนที่มีชื่อหรือรหัสรอบ "{{phrase}}"

source: Set target
th_th: กำหนดเป้าหมาย

source: Are you sure you want to delete the target budget?
th_th: คุณแน่ใจหรือไม่ว่าต้องการลบงบประมาณเป้าหมาย

source: Delete target
th_th: ลบเป้าหมาย

source: Target budget amount
th_th: จำนวนงบประมาณเป้าหมาย

source: Target budget
th_th: งบประมาณเป้าหมาย

source: Manage the target budget per compensation element
th_th: จัดการงบประมาณเป้าหมายต่อองค์ประกอบผลตอบแทน

source: Set target budget
th_th: กำหนดงบประมาณเป้าหมาย

source: Last edited
th_th: แก้ไขล่าสุด

source: Round
th_th: รอบ

source: STI bonus
th_th: โบนัส STI

source: The comp round code must be unique.
th_th: รหัสรอบการจ่ายผลตอบแทนจะต้องไม่ซ้ำกัน

source: View compensation round
th_th: ดูรอบการชดเชย

source: Access standard reports and create specific analyses linked to a comp round.
th_th: เข้าถึงรายงานมาตรฐานและสร้างการวิเคราะห์เฉพาะที่เชื่อมโยงกับรอบการจ่ายผลตอบแทน

source: Budget & modeling
th_th: งบประมาณและการสร้างโมเดล

source: Create a budget based on your comp elements and your comp framework. Enable modeling on the population.
th_th: สร้างงบประมาณโดยอิงตามองค์ประกอบและกรอบงานองค์ประกอบของคุณ เปิดใช้งานการสร้างโมเดลตามประชากร

source: Coming soon
th_th: เร็วๆ นี้

source: Compensation Tree & Elements
th_th: แผนภูมิและองค์ประกอบของผลตอบแทน

source: Compensation framework
th_th: กรอบงานผลตอบแทน

source: FX management
th_th: การจัดการ FX

source: Enable currency and link rates to comp elements/rounds.
th_th: เปิดใช้งานอัตราแลกเปลี่ยนและลิงก์ไปยังองค์ประกอบ/รอบการชำระเงิน

source: Comp rounds
th_th: รอบการจ่ายผลตอบแทน

source: Create comp round
th_th: สร้างรอบการจ่ายผลตอบแทน

source: Create and manage a comp rounds based on a data core. Link specific comp elements and a budget.
th_th: สร้างและจัดการรอบการจ่ายผลตอบแทนโดยอิงตามข้อมูลหลัก เชื่อมโยงองค์ประกอบการจ่ายผลตอบแทนเฉพาะและงบประมาณ

source: Simulations
th_th: การจำลอง

source: Simulation outcomes based on the budget, comp and analytics.
th_th: ผลลัพธ์ของการจำลองขึ้นอยู่กับงบประมาณ ผลตอบแทน และการวิเคราะห์

source: Comp tree & elements
th_th: โครงสร้างค่าตอบแทนและองค์ประกอบ

source: Create your organization's compensation framework and specific comp elements: salary, allowances, per diems, bonus, deferrals, equity and indirect benefits/allowances.
th_th: สร้างกรอบการจ่ายผลตอบแทนและองค์ประกอบผลตอบแทนที่เจาะจงขององค์กรของคุณ ได้แก่ เงินเดือน เงินสมทบ ค่าเบี้ยเลี้ยง โบนัส รายการตัดจ่าย หุ้น และผลประโยชน์/ค่าตอบแทนทางอ้อม

source: Create competency scales
th_th: สร้างมาตรวัดสมรรถนะ

source: Are you sure you want to delete this competency scale?
th_th: คุณแน่ใจหรือไม่ว่าต้องการลบระดับความสามารถนี้

source: Delete competency scale
th_th: ลบระดับความสามารถ

source: The selected scale is currently in use and cannot be deleted. Remove it from any active plans or processes before attempting to delete it again.
th_th: มาตรวัดที่เลือกนั้นใช้งานอยู่ในขณะนี้และไม่สามารถลบได้ โปรดลบมาตรวัดดังกล่าวออกจากแผนหรือกระบวนการที่ใช้งานอยู่ก่อนที่จะพยายามลบอีกครั้ง

source: The scale is active; it cannot be deleted.
th_th: มาตรวัดกำลังใช้งานอยู่ ไม่สามารถลบได้

source: Create competency scale
th_th: สร้างมาตรวัดความสามารถ

source: Create skills & competency group
th_th: สร้างกลุ่มทักษะและความสามารถ

source: Group details
th_th: รายละเอียดกลุ่ม

source: Add skills
th_th: เพิ่มทักษะ

source: List of competencies for the scale
th_th: รายการความสามารถสำหรับการวัด

source: Edit competency scale
th_th: แก้ไขมาตราวัดความสามารถ

source: Add competency
th_th: เพิ่มความสามารถ

source: No competencies yet
th_th: ยังไม่มีความสามารถ

source: Competency scale
th_th: ระดับความสามารถ

source: Get started by uploading one.
th_th: เริ่มต้นโดยการอัปโหลดไฟล์หนึ่งไฟล์

source: No skills libraries yet!
th_th: ยังไม่มีคลังทักษะในขณะนี้!

source: No competency scales available. You can create scales in the "Competency scales" page of the Performance Management module.
th_th: ไม่มีมาตรวัดความสามารถ คุณสามารถสร้างมาตรวัดได้ในหน้า "มาตรวัดความสามารถ" ของโมดูลการจัดการประสิทธิภาพ

source: No skills available. You can upload skills in the "Skills library" page of the Performance Management module.
th_th: ไม่มีทักษะที่พร้อมใช้งาน คุณสามารถอัปโหลดทักษะในหน้า "ไลบรารีทักษะ" ของโมดูลการจัดการประสิทธิภาพ

source: Edit skills & competency group
th_th: แก้ไขกลุ่มทักษะและสมรรถนะ

source: Select skills to add to the group
th_th: เลือกทักษะที่จะเพิ่มเข้าในกลุ่ม

source: Categories
th_th: หมวดหมู่

source: Skills
th_th: ทักษะ

source: Categories: {{count}}
th_th: หมวดหมู่: {{count}}

source: Scale:
th_th: มาตรวัด:

source: Skills selected: {{count}}
th_th: ทักษะที่เลือก: {{count}}

source: Skills: {{count}}
th_th: ทักษะ: {{count}}

source: Goal Management
th_th: การจัดการเป้าหมาย

source: Precision and flexibility with goal plans. Set fixed or recurring dates. Integrate with goal types, and assign your entire organization or specific populations.
th_th: ความแม่นยำและความยืดหยุ่นกับแผนเป้าหมาย กำหนดวันที่แน่นอนหรือเป็นประจำ บูรณาการกับประเภทเป้าหมาย และกำหนดองค์กรทั้งหมดของคุณหรือกลุ่มประชากรเฉพาะ

source: Craft personalized tags visible in goals. Workers can easily select fitting tags that refine the focus of their goals and foster clear direction in their pursuits.
th_th: สร้างแท็กส่วนบุคคลที่มองเห็นได้ในเป้าหมาย พนักงานสามารถเลือกแท็กที่เหมาะสมได้อย่างง่ายดายเพื่อเน้นย้ำจุดเน้นของเป้าหมายและส่งเสริมทิศทางที่ชัดเจนในการบรรลุเป้าหมาย

source: Goals made simple with goal types. Set individual or organizational goals, and target your entire company or specific populations.
th_th: ตั้งเป้าหมายให้ง่ายขึ้นด้วยประเภทเป้าหมาย ตั้งเป้าหมายส่วนบุคคลหรือองค์กร และกำหนดเป้าหมายทั้งบริษัทหรือกลุ่มประชากรเฉพาะ

source: Define assignment permissions
th_th: กำหนดสิทธิ์การมอบหมาย

source: Select the elements and features enabled in the review
th_th: เลือกองค์ประกอบและคุณสมบัติที่เปิดใช้งานในการประเมินผลงาน

source: Review form components
th_th: ส่วนประกอบของแบบฟอร์มตรวจสอบ

source: Enter the basic information for the review
th_th: ป้อนข้อมูลพื้นฐานสำหรับการประเมินผลงาน

source: Build your own questions and fields
th_th: สร้างคำถามและฟิลด์ของคุณเอง

source: Section weights can be set up only when goals are enabled for this review template or when custom sections are created.
th_th: สามารถตั้งค่าน้ำหนักของแต่ละส่วนได้เฉพาะเมื่อมีการเปิดใช้งานเป้าหมายสำหรับแม่แบบการประเมินนี้ หรือเมื่อมีการสร้างส่วนที่กำหนดเอง

source: Review and adjust weights to ensure they total 100%.
th_th: ตรวจสอบและปรับน้ำหนักให้แน่ใจว่ารวมกันแล้วได้ 100%

source: TOTAL
th_th: รวมทั้งหมด

source: The weight cannot exceed 100%.
th_th: น้ำหนักต้องไม่เกิน 100%.

source: The weight must be at least 0%.
th_th: น้ำหนักต้องมีอย่างน้อย 0%

source: Section weights
th_th: น้ำหนักของส่วน

source: Review stages will contain a prepopulated set of stages, with only one step: Manager review.
th_th: ขั้นตอนการทบทวนจะประกอบด้วยชุดขั้นตอนที่เติมไว้ล่วงหน้า โดยมีเพียงหนึ่งสเต็ป: การทบทวนของผู้จัดการ

source: Goal setting template
th_th: เทมเพลตการตั้งเป้าหมาย

source: Score calculation
th_th: การคำนวณคะแนน

source: The detailed configuration will be defined in the final step of review creation.
th_th: การกำหนดค่ารายละเอียดจะถูกกำหนดในขั้นตอนสุดท้ายของการสร้างรีวิว

source: Enable total score calculation
th_th: เปิดใช้งานการคำนวณคะแนนรวม

source: Define the participants to the review
th_th: กำหนดผู้เข้าร่วมการประเมินผลงาน

source: Specify the review assignment permissions
th_th: ระบุสิทธิ์การมอบหมายการประเมินผลงาน

source: Review stages
th_th: ขั้นตอนการประเมินผลงาน

source: The detailed configuration will be defined in the final step of the review creation.
th_th: การกำหนดค่ารายละเอียดจะถูกกำหนดในขั้นตอนสุดท้ายของการสร้างการประเมิน

source: The review process was successfully closed.
th_th: กระบวนการประเมินผลงานถูกปิดสำเร็จแล้ว

source: The review template was successfully deleted.
th_th: ลบแม่แบบการประเมินผลงานสำเร็จแล้ว

source: Primary owners can edit the population (based on creator's access).
th_th: เจ้าของหลักสามารถแก้ไขกลุ่มพนักงานได้ (ขึ้นอยู่กับสิทธิ์การเข้าถึงของผู้สร้าง)

source: Before proceeding, please select an item to customize your review form.
th_th: ก่อนที่จะดำเนินการต่อ โปรดเลือกรายการเพื่อปรับแต่งแบบฟอร์มการประเมินผลงานของคุณ

source: Please fill in all mandatory fields.
th_th: โปรดกรอกข้อมูลที่จำเป็นให้ครบ

source: To complete the process, all required information must first be provided by the owner.
th_th: ในการดำเนินการให้เสร็จสิ้น เจ้าของจะต้องให้ข้อมูลที่จำเป็นทั้งหมดก่อน

source: This template is currently in progress.
th_th: ขณะนี้เทมเพลตนี้กำลังอยู่ระหว่างดำเนินการ

source: Select the rating scale in the menu.
th_th: เลือกระดับคะแนนได้จากเมนู

source: The review process was successfully reopened.
th_th: กระบวนการประเมินผลงานได้เปิดขึ้นใหม่สำเร็จแล้ว

source: All your changes were saved as draft.
th_th: การเปลี่ยนแปลงของคุณทั้งหมดได้รับการบันทึกเป็นแบบร่าง

source: Skill & Competency Groups
th_th: กลุ่มทักษะและความสามารถ

source: Select at least one skill to proceed.
th_th: เลือกอย่างน้อยหนึ่งทักษะเพื่อดำเนินการต่อ
